БухЭксп/InformationRegisters/CW_НумерацияПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НумерацияПриложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрефиксНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НумерацияПриложений/Ext/ManagerModule.bsl
// Функция - Получить последний номер
//
// Получает последний записанный номер для указанного префикса и договора
//
// Параметры:
//  Параметры	 - 	Структура("Договор,ПрефиксНомера",)  
// 
// Возвращаемое значение:
//   - Последний записанный номер 
//
Функция ПолучитьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НумерацияПриложений.ПрефиксНомера КАК ПрефиксНомера,
	               |	CW_НумерацияПриложений.Номер КАК Номер
	               |ИЗ
	               |	РегистрСведений.CW_НумерацияПриложений КАК CW_НумерацияПриложений
	               |ГДЕ
	               |	CW_НумерацияПриложений.Договор = &Договор
	               |	И CW_НумерацияПриложений.ПрефиксНомера = &ПрефиксНомера";
	
	Запрос.УстановитьПараметр("Договор", 		Параметры.Договор);
	Запрос.УстановитьПараметр("ПрефиксНомера", 	Параметры.ПрефиксНомера);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Процедура - Записать последний номер
//
// Записывает установленный номер для указанного префикса и договора
//
// Параметры:
//  Параметры	 - 	Структура("Договор,ПрефиксНомера,Номер",)  
//
Процедура ЗаписатьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.CW_НумерацияПриложений.СоздатьМенеджерЗаписи();
	Запись.Договор 			= Параметры.Договор;
	Запись.ПрефиксНомера 	= Параметры.ПрефиксНомера;
	Запись.Номер			= Параметры.Номер;
	
	Запись.Записать(Истина);
	
КонецПроцедуры
